[
    {
        "title": "Lentil and Chicken Soup with Sweet Potatoes and Escarole",
        "ingredients": "['1 cooked chicken carcass (from 1 store-bought rotisserie chicken or homemade roast chicken)', '1 lb. sweet potatoes (about 2 medium), peeled, cut into 1\" pieces', '3/4 cup French lentils (about 5 oz.), rinsed', '1 tsp. kosher salt, plus more', '2 Tbsp. extra-virgin olive oil', '10 celery stalks, sliced on the bias into 1/4\" slices', '6 garlic cloves, thinly sliced', '1 1/2 cups shredded cooked chicken (from 1/2 of a store-bought rotisserie chicken or homemade roast chicken)', '1/2 head escarole, cut into bite-size pieces', '1/2 cup finely chopped dill', '2 Tbsp. fresh lemon juice']",
        "instructions": "Place chicken carcass, potatoes, lentils, and 1 tsp. salt in a large pot. Cover with 8 cups water. Bring to a boil over high heat, skimming off any foam, then reduce heat to medium-low and simmer until potatoes are fork tender and lentils are cooked through, 10–12 minutes. Discard chicken carcass.\nMeanwhile, heat oil in a large heavy skillet over medium-high. Add celery and garlic and cook, stirring often, until celery and garlic are lightly golden brown and tender, about 12 minutes.\nStir celery, garlic, shredded chicken, and escarole into soup and cook, stirring occasionally, until escarole is wilted, about 5 minutes. Remove from heat. Stir in dill and lemon juice; season soup with salt.",
        "youtubeLinks": "https://www.youtube.com/watch?v=yKEhXivJGCw"
    },
    {
        "title": "Chicken Soup with Charred Cabbage",
        "ingredients": "['1 cooked chicken carcass (from a store-bought rotisserie or homemade roast chicken), plus 1 1/2 cups shredded skinless roast chicken meat', '8 oz. shiitake mushrooms, stems reserved, caps torn in half', '6 garlic cloves, crushed', '1 tsp. kosher salt, plus more', '2 Tbsp. extra-virgin olive oil', '1 medium head of green cabbage (about 1 lb.), cored, sliced into 1/2\"-thick ribbons', 'Freshly ground black pepper', 'Chili oil (for serving; optional)']",
        "instructions": "Bring chicken carcass, shiitake stems, garlic, 1 tsp. salt, and 8 cups water to a boil in a large pot, skimming foam from surface as needed. Cover pot and reduce heat to medium. Simmer 15 minutes. Strain broth through a fine-mesh sieve into a large bowl. Rinse out pot, then pour broth back in.\nMeanwhile, heat oil in a large skillet over medium-high. Cook mushroom caps, stirring occasionally, until golden brown and softened, 7–9 minutes. Transfer mushrooms to a plate; season with salt.\nAdd cabbage to same skillet, press into an even layer, and cook, undisturbed, 2 minutes; season with salt. Turn cabbage with tongs, then continue to cook, undisturbed, until lightly charred and tender in some spots and still crisp in others, about 2 minutes.\nAdd mushrooms, cabbage, and shredded chicken to broth and cook over medium heat just until chicken is warmed through, about 3 minutes. Season soup with salt and pepper. Divide among bowls and drizzle with chili oil if desired.",
        "youtubeLinks": "https://www.youtube.com/watch?v=KJnIbl8TMAY"
    },
    {
        "title": "Fully Salted Roast Chicken",
        "ingredients": "['1 (3 1/2–4-lb.) chicken', 'Kosher salt']",
        "instructions": "Pat dry chicken with paper towels. Holding a 5-finger pinch of salt and positioning your hand at least 10\" above chicken, evenly rain salt down over chicken. Repeat with several more pinches of salt until both inside and outside of chicken are covered with salt (be generous and make sure to get inside all the nooks and crannies). Place chicken on a wire rack set inside a rimmed baking sheet and chill uncovered at least 8 hours and up to 1 day.\nLet sit at room temperature 1 hour.\nPreheat oven to 425°F. Roast chicken until an instant-read thermometer inserted into the thickest part of chicken thigh registers 165°F, 40–55 minutes. Transfer chicken to a cutting board and let rest 15 minutes before carving.",
        "youtubeLinks": "https://www.youtube.com/watch?v=Wq6v7NfiFq8"
    },
    {
        "title": "Cast-Iron Roast Chicken",
        "ingredients": "['1 (3 1/2–4-pound) whole chicken', 'Kosher salt', '1 tablespoon olive oil']",
        "instructions": "Pat chicken dry with paper towels and season generously with salt, inside and out. (We use 1 tsp. Diamond Crystal or 1/2 tsp. Morton kosher salt per lb.) Tie legs together with kitchen twine. Let sit 1 hour to allow salt to penetrate, or chill, uncovered, up to 1 day ahead.\nPlace a rack in upper third of oven and set a 12\" cast-iron skillet or 3-qt. enameled cast-iron baking dish on rack. Preheat oven to 425°F. Once oven reaches temperature, pat chicken dry with paper towels and lightly coat with half of the oil. Drizzle remaining oil into hot skillet (this helps keep the chicken from sticking and tearing the skin). Place chicken in skillet and roast until an instant-read thermometer inserted into the thickest part of breasts registers 155°F, 50–60 minutes (temperature will climb to 165°F as chicken rests). Let chicken rest in skillet at least 20 minutes and up to 45 minutes.Transfer chicken to a cutting board and carve legs off, followed by breasts.",
        "youtubeLinks": "https://www.youtube.com/watch?v=jCMz9RSotZM"
    },
    {
        "title": "My Chicken Broth-Braised Baby Turnips",
        "ingredients": "['14 ounces small new turnips, all about the same size for even cooking, peeled', '1/4 ounce superfine sugar', '1 pinch fine salt', '3 tablespoons butter', '1 1/4 cups chicken broth, preferably homemade', '3-6 tablespoons pan drippings from a roast chicken, or 2 tablespoons olive oil', '1 tablespoon flat-leaf parsley, chopped']",
        "instructions": "Peel the turnips and put them in a large bowl with the sugar and pinch of fine salt. Toss to coat the turnips thoroughly.\nIn a large pot, melt the butter. When it is blond and foamy, add the turnips to the pot in a single layer and brown on all sides. When they are golden brown, add a third of the chicken broth and cook, covered, over low heat until the broth has been completely absorbed. Repeat a second and then a third time: When this is done, the turnips are cooked. (Turnips should never be left dry in the pot. If the broth reduces too quickly, add a bit of water when necessary.)\nDrizzle with a few spoons of chicken jus or olive oil and bring to a simmer. When it begins to bubble, sprinkle with parsley and serve immediately.",
        "youtubeLinks": "https://www.youtube.com/watch?v=8rHrtHdxHmQ"
    }
]